src/sub/tests/unit/fixtures/stripe_cust_test6.json

{
    "id": "cus_test3",
    "object": "customer",
    "account_balance": 0,
    "address": null,
    "balance": 0,
    "created": 1567635511,
    "currency": "usd",
    "default_source": null,
    "delinquent": false,
    "description": null,
    "discount": null,
    "email": null,
    "failure_code": "card_declined",
    "failure_message": "Your card was declined.",
    "invoice_prefix": "F351DA7",
    "invoice_settings": {
        "custom_fields": null,
        "default_payment_method": null,
        "footer": null
    },
    "livemode": false,
    "metadata": {},
    "name": null,
    "phone": null,
    "preferred_locales": [],
    "shipping": null,
    "sources": {
        "object": "list",
        "data": [
            {
                "funding": "credit",
                "last4": "1234",
                "exp_month": 12,
                "exp_year": 2020,
                "country": "HK"
            }
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_test1/sources"
    },
    "subscriptions": {
        "object": "list",
        "data": [
            {
                "id": "sub_test3",
                "object": "subscription",
                "application_fee_percent": null,
                "current_period_start": 1565895370,
                "current_period_end": 1568573770,
                "cancel_at_period_end": false,
                "ended_at": null,
                "latest_invoice": "in_test1",
                "plan": {
                    "id": "plan_test1",
                    "object": "plan",
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 1000,
                    "amount_decimal": "1000",
                    "billing_scheme": "per_unit",
                    "created": 1555354251,
                    "currency": "usd",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {
                        "service": "{\"service_id\": \"srv_001\", \"service_name\": \"Water Bottles\"}"
                    },
                    "nickname": "Mozilla_Subscription",
                    "product": "prod_test1",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": 30,
                    "usage_type": "licensed"
                },
                "status": "incomplete"
            }
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_test1/subscriptions"
    },
    "tax_exempt": "none",
    "tax_ids": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/customers/cus_test1/tax_ids"
    },
    "tax_info": null,
    "tax_info_verification": null
}
